Revit 2024 API
MEPCurve.ReferenceLevel Property
The reference level of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Level ReferenceLevel { get; set; }
Visual Basic
Public Property ReferenceLevel As Level
	Get
	Set
Visual C++
public:
property Level^ ReferenceLevel {
	Level^ get ();
	void set (Level^ value);
}
Remarks
This property is used to retrieve the reference level of the MEP curve. If the curve is not in a horizontal plane, this value will be the start point's reference level.
See Also
MEPCurve Class
Autodesk.Revit.DB Namespace